{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.3.1.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 49], "dtype": "float32", "sparse": false, "name": "encoder_inputs"}, "name": "encoder_inputs", "inbound_nodes": []}, {"class_name": "Bidirectional", "config": {"name": "encoder_bidirectionnal_lstm", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "name": "encoder_bidirectionnal_lstm", "inbound_nodes": [[["encoder_inputs", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["encoder_bidirectionnal_lstm", 0, 1, {}], ["encoder_bidirectionnal_lstm", 0, 3, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["encoder_bidirectionnal_lstm", 0, 2, {}], ["encoder_bidirectionnal_lstm", 0, 4, {}]]]}], "input_layers": [["encoder_inputs", 0, 0]], "output_layers": [["concatenate", 0, 0], ["concatenate_1", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "encoder_bidirectionnal_lstm/forward_lstm/kernel", "shape": [49, 256], "dtype": "float32"}, {"name": "encoder_bidirectionnal_lstm/forward_lstm/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "encoder_bidirectionnal_lstm/forward_lstm/bias", "shape": [256], "dtype": "float32"}, {"name": "encoder_bidirectionnal_lstm/backward_lstm/kernel", "shape": [49, 256], "dtype": "float32"}, {"name": "encoder_bidirectionnal_lstm/backward_lstm/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "encoder_bidirectionnal_lstm/backward_lstm/bias", "shape": [256], "dtype": "float32"}]}]}